alf = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
b = 0
c = 0
d = 0
h = ''
m = 0
u = int(input('''какой шифр исользовать?
1 - шифр Цезаря(не салат)
2 - шифр забыл имя(тоже не салат)
3 - азбука морзе
'''))
if u ==1:
    print('шифр Цезаря меняет кажую букву на ее же номер с конца алфавита')
    a = str(input('зашифровать/расшифровать: '))
    a = a.lower()
    while b<=len(a):
        if m ==0:
            g = ' ' + a
            m +=1
        d = alf.find(g[b])
        if m ==1:
            g.replace(' ', '')
        m +=1
        c = -d
        if c!=1:
            c-=1
            h += alf[c]
        elif m>2:
            if g[b] == ' ':
                h += ' '
            elif g[b] == ',':
                h +=','
            elif g[b] == "'":
                h +="'"
            elif g[b] == '1':
                h +='1'
            if g[b] == '2':
                h += '2'
            elif g[b] == '3':
                h +='3'
            elif g[b] == '4':
                h +="4"
            elif g[b] == '5':
                h +='5'
            elif g[b] == '6':
                h +='6'
            if g[b] == '7':
                h += '7'
            elif g[b] == '8':
                h +='8'
            elif g[b] == '9':
                h +="9"
            elif g[b] == '0':
                h +='0'
        b +=1
    print(h)
elif u==2:
    print('шифр переносит каждую букву на 1 вперед по алфавиту')
    c = int(input('''зашифровать - 1
расшифровать - 2
'''))
    alf += '1234567890'
    if c ==1:
        a = str(input('зашифровать: '))
        a = a.lower()
        while b<len(a):
            d = alf.find(a[b])
            if d !=32 and d!=-1:
                d +=1
                h += str(alf[d])
            else:
                if a[b] == ' ':
                    h += ' '
                elif a[b] == ',':
                    h += ','
                elif d ==32:
                    h +='а'
            b +=1
        print(h)
    elif c ==2:
        a = str(input('расшифровать: '))
        a = a.lower()
        while b < len(a):
            d = alf.find(a[b])
            if d != 32 and d != -1:
                d -= 1
                h += str(alf[d])
            else:
                if a[b] == ' ':
                    h += ' '
                elif a[b] == ',':
                    h += ','
                elif d == 32:
                    h += 'а'
            b += 1
        print(h)
elif u==3:
    morse = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.', 'ж': '...-',
             'з': '--..', 'и': '..', 'й': '.---', 'к': '-.-', 'л': '.-..', 'м': '--', 'н': '-.', 'о': '---',
             'п': '.--.', 'р': '.-.', 'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.',
             'ч': '---.', 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--', 'ь': '-..-', 'э': '..-..',
             'ю': '..--', 'я': '.-.-', ' ': ' ',
             '0': '-----', '1': '.----', '2': '..---',
             '3': '...--', '4': '....-', '5': '.....',
             '6': '-....', '7': '--...', '8': '---..',
             '9': '----.'}
    c = int(input('''зашифровать - 1
расшифровать - 2
'''))
    def mor(n):
        u = ''
        for i in [morse.get(i) for i in n]:
            u += str(i)
        return u
    def ismor(n):
        u = ''
        for i in [k for g in n.split() for k, v in morse.items() if v == g]:
            u += str(i)
        return u
    if c ==1:
        b = input('зашифровать: ').lower()
        u1 = ''
        for i in b:
            if i != ' ':
                u1 += i + ' '
        b = u1.rstrip(' ')
        print(mor(b))
    elif c==2:
        b = input('расшифровать: ')
        print(ismor(b))